Repository: abhinavsanthoshpp/fake_currency_detector_trial
Catalog: lib/l10n/app_*.arb
Languages: ml, te

source: Scan History
ml: സ്കാന്‍ ചരിത്രം
te: స్కాన్ చరిత్ర

source: Authentic
ml: യഥാർത്ഥം
te: ప్రామాణికమైన

source: Suspicious
ml: സംശയാസ്പദം
te: అనుమానాస్పదం

source: Scan Another Currency
ml: മറ്റൊരു കറൻസി സ്കാൻ ചെയ്യുക
te: మరో కరెన్సీని స్కాన్ చేయండి

source: Scan Results
ml: സ്കാൻ ഫലങ്ങൾ
te: స్కాన్ ఫలితాలు

source: Confidence Level
ml: വിശ്വാസ്യത നില
te: విశ్వసనీయత స్థాయి

source: Scanned
ml: സ്കാൻ ചെയ്തത്
te: స్కాన్ చేయబడింది

source: Currency
ml: കറൻസി
te: కరెన్సీ

source: Status
ml: സ്ഥിതി
te: స్థితి

source: Clear All History
ml: എല്ലാ ചരിത്രവും ഇല്ലാതാക്കുക
te: అన్ని చరిత్రను క్లియర్ చేయండి

# areYouSure
source: Are you sure you want to delete all scan history?
ml: നിങ്ങൾ വാസ്തവത്തിൽ എല്ലാ സ്കാൻ ചരിത്രവും മായ്ക്കുവാൻ ആഗ്രഹിക്കുന്നുവോ?
te: మీరు నిజంగా అన్ని స్కాన్ చరిత్రను తొలగించాలనుకుంటున్నారా?

source: Cancel
ml: രദ്ദാക്കുക
te: రద్దు చేయండి

source: Clear All
ml: എല്ലാം നീക്കം ചെയ്യുക
te: అన్నీ క్లియర్ చేయండి

# noScanHistory
source: No scan history yet
ml: ഇതുവരെ സ്കാൻ ചരിത്രമില്ല
te: ఇంకా స్కాన్ చరిత్ర లేదు

# startScanning
source: Start scanning currency to see history
ml: ചരിത്രം കാണാൻ കറൻസി സ്കാൻ ചെയ്യൽ ആരംഭിക്കുക
te: చరిత్రను చూడటానికి కరెన్సీ స్కాన్ చేయడం ప్రారంభించండి

# scanSaved
source: Scan saved: {currency} - {status}
ml: സ്കാൻ സംഭരിച്ചു: {currency} - {status}
te: స్కాన్ సేవ్ చేయబడింది: {currency} - {status}

source: Error taking picture
ml: ചിത്രം എടുക്കുന്നതിൽ പിഴവ്
te: చిత్రం తీయడంలో లోపం

source: Settings
ml: ക്രമീകരണങ്ങൾ
te: సెట్టింగులు

source: Language
ml: ഭാഷ
te: భాష

source: Support
ml: സഹായം
te: మద్దతు

source: Help
ml: സഹായം
te: సహాయం

source: About
ml: കുറിച്ച്
te: గురించి

source: Home
ml: ഹോം
te: హోమ్

source: Scan
ml: സ്കാൻ
te: స్కాన్

source: History
ml: ചരിത്രം
te: చరిత్ర

# welcomeTitle
source: Welcome to DeepScan
ml: ഡിപ്സ്കാനിലേക്ക് സ്വാഗതം
te: డీప్‌స్కాన్‌కు స్వాగతం

# welcomeSubtitle
source: verify notes using ml
ml: അപ്ലിക്കേഷൻ ഉപയോഗിച്ച് നോട്ടുകള്‍ പരിശോധിക്കുക
te: ఉపయోగించి నోట్లను ధృవీకరించండి

# lightingTip
source: Ensure good lighting and align note edges for best results
ml: ഭേദപ്പെട്ട ഫലങ്ങൾക്കായി നല്ല വിളക്കിലും നോട്ടിന്റെ അറ്റങ്ങളിൽ ചേർത്തിടലും ഉറപ്പാക്കുക
te: మంచి ఫలితాల కోసం ఉత్తమ లైటింగ్‌ను నిర్ధారించండి మరియు నోట్ ఎడ్జ్‌లను సరిపోసుకోండి

source: View all
ml: എല്ലാം കാണുക
te: అన్నీ చూడండి

source: Recent Scans
ml: സമീപകാല സ്കാനുകൾ
te: తాజా స్కాన్‌లు

# liveScanSubtitle
source: Real-time detection with edge guidance
ml: എജ് ഗൈഡൻസോടെ റിയൽ-ടൈം കണ്ടെത്തൽ
te: ఎడ్జ్ గైడెన్స్‌తో రియల్-టైమ్ డిటెక్షన్

# liveScanTitle
source: Live Banknote Scan
ml: ലൈവ് ബാങ്ക്‌നോട്ട് സ്കാൻ
te: లైవ్ బ్యాంక్‌నోట్ స్కాన్

source: Quick Actions
ml: ത്വരിത നടപടി
te: త్వరిత చర్యలు
